Tekla Open API Reference for Tekla Structures 2025
CoordinateSystem.Origin Property
 The origin of the coordinate system.
 Namespace: Tekla.Structures.Geometry3d
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public Point Origin { get; set; }
Public Property Origin As Point
	Get
	Set
Property Value
Type: Point
See Also
Reference
CoordinateSystem Class
Tekla.Structures.Geometry3d Namespace